app/controllers/api/ships_controller.rb

  def index
    #below our API key is assigned to an instance variable...

    render json: Ship.all
---
SELECT "ships".* FROM "ships"

  def show
    ship = Ship.find(params[:id])
---
SELECT  "ships".* FROM "ships" WHERE "ships"."id" = $1 LIMIT 1  [["id", 2]]

  def create
    @ship = Ship.create({
      :name => params[:name],
      :latitude => params[:latitude],
      :longitude => params[:longitude],
      :yearlost => params[:yearlost],
      :description => params[:description]
      })
---
INSERT INTO "ships" ("name", "latitude", "yearlost", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Edmund Fitzgerald "], ["latitude", 87.44444], ["yearlost", 1984], ["created_at", "2015-08-27 16:19:53.389442"], ["updated_at", "2015-08-27 16:19:53.389442"]]

  def update
    @ship = Ship.find(params[:id])
    @ship.update({
    :name => params[:name],
    :latitude => params[:latitude],
    :longitude => params[:longitude],
    :yearlost => params[:yearlost],
    :description => params[:description]
  })
---
SELECT  "ships".* FROM "ships" WHERE "ships"."id" = $1 LIMIT 1  [["id", 7]]
UPDATE "ships" SET "name" = $1, "latitude" = $2, "longitude" = $3, "yearlost" = $4, "description" = $5, "updated_at" = $6 WHERE "ships"."id" = $7  [["name", "Edmund"], ["latitude", 87.4], ["longitude", 34.5], ["yearlost", 1999], ["description", "The wreck edmund fitgerald was a ... "], ["updated_at", "2015-08-27 16:52:17.869358"], ["id", 7]]

  def destroy
    @ship = Ship.find(params[:id])
    @ship.destroy
---
SELECT  "ships".* FROM "ships" WHERE "ships"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "ships" WHERE "ships"."id" = $1  [["id", 3]]